app/controllers/school_classes_controller.rb

    def index
        @schools = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def show
        @school = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @school = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Mathematics"], ["room_number", 424]]